<template>
    <div class="w-full flex justify-center px-4 py-4 items-center">
        <img :src="data[0].img" class="w-[300px]" alt="">
    </div>
    <div class="text-3xl w-full h-[60%] bg-white rounded-t-lg flex justify-between items-center px-4  flex-col pt-4">
        <div class="flex justify-start items-center flex-col gap-2 overflow-scroll">
            <span class="font-Manrope_Bold text-[24px]">{{ data[0].name }}</span>
            <span class="font-Manrope_Medium text-[16px] ">{{ data[0].discription }}</span>
        </div>
    </div>
</template>

<script setup>

const data = [
    {
        id: 1,
        name: 'Горячие трещины',
        discription: 'Горячие трещины. Они появляются в процессе сварки или в процессе кристаллизации сварного соединения. Температура в этот момент может подняться выше 10 000 °C. Холодные трещины. Эти трещины появляются после завершения сварки и снижения температуры металла. Они могут образоваться спустя несколько часов или даже дней после проведения сварочных работ. Чаще всего это происходит при сварке стали. Причиной этого дефекта обычно являются деформация структуры стали. Кратеры. Обычно они образуются ближе к концу сварного шва. Когда сварочная ванна охлаждается и затвердевает, ей необходимо иметь достаточный объем, чтобы преодолеть усадку металла шва. В противном случае образуется кратерная трещина.',
        img: '/defects/1.png'
    },
    {
        id: 2,
        name: 'Горячие трещины',
        discription: 'Они появляются в процессе сварки или в процессе кристаллизации сварного соединения. Температура в этот момент может подняться выше 10 000 °C.',
        img: ''
    },
    {
        id: 3,
        name: 'Горячие трещины',
        discription: 'Они появляются в процессе сварки или в процессе кристаллизации сварного соединения. Температура в этот момент может подняться выше 10 000 °C.',
        img: ''
    }
]

</script>